print("Hello World")

my_int = 10 # ІНТ ЦЕ КАРОЧ ЦІЛЕ ЧИСЛО
my_float = 3.222532421 #Число с точкой
my_str = "Якісь текст" #Рядок с текстом
my_list = [1, 2, 3, "можна писати текст"] #Список
my_tuple = (3, 4 ,5) #не помню шо це
my_bool = True or False #Правда або неправда
my_set = {1, 2, 3} #тоже не помню шо це але вроді щось важливе

print(my_int, type(my_int)) #Виводить значеня і тип.
print(my_float, type(my_float))
print(my_str, type(my_str))
print(my_list, type(my_list))
print(my_tuple, type(my_tuple))

#----------------------------------------------------------------------------------------------------------------------

#ОПЕРАТОРИ

a = 5
b = 2

#АРИФМЕТИКА
print(a + b) #ДОДАВАННЯ
print(a - b) #ВІДНІМАННЯ
print(a * b) #МНОЖЕННЯ
print(a / b) #ДІЛЕНЯ
print(a // b) #ДІЛЕННЯ БЕЗ ОСТАЧІ
print(a % b) #ЗАЛИШОК ВІД ДІЛЕННЯ
print(a ** b) #ПІДНЕСЕННЯ ДО СТЕПЕНЯ

#ПОРІВНЯННЯ
print(a > b) #БІЛЬШЕ
print(a < b) #МЕНШЕ
print(a >= b) #БІЛЬШЕ АБО ДОРІВНЮЄ
print(a <= b) #МЕНШЕ АБО ДОРІВНЮЄ
print(a == b) #ДОРІВНЮЄ
print(a != b) #НЕ ДОРІВНЮЄ






